# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0
  - [-1, 1, Conv, [128, 3, 2]]   # 1
  - [-1, 3, C2f, [128, True]]    # 2

    # ---------- CoTM -----------
  - [-1, 1, Conv, [256, 3, 2]]   # 3
  - [-1, 1, CoT3, [256]]         # 4
  - [-1, 6, C2f, [256, True]]    # 5
    # ---------------------------

    # ---------- CoTM -----------
  - [-1, 1, Conv, [512, 3, 2]]   # 6
  - [-1, 1, CoT3, [512]]         # 7
  - [-1, 6, C2f, [512, True]]    # 8
    # ---------------------------

    # ---------- CoTM -----------
  - [-1, 1, Conv, [1024, 3, 2]]  # 9
  - [-1, 1, CoT3, [1024]]        # 10
  - [-1, 3, C2f, [1024, True]]   # 11
    # ---------------------------
      
  - [-1, 1, SPPF, [1024, 5]]     # 12


# Neck
head:
  - [-1, 1, CARAFE, [512,3,2]]   # 13
  - [[-1, 8], 1, Concat, [1]]    # 14
  - [-1, 3, C2f, [512]]          # 15

  - [-1, 1, CARAFE, [256,3,2]]   # 16
  - [[-1, 5], 1, Concat, [1]]    # 17

    # ---------- ODCM -----------
  - [-1, 3, C2f, [256]]          # 18
  - [-1, 1, ODConv, [256]]       # 19 P1
    # ---------------------------

  - [-1, 1, Conv, [256, 3, 2]]     # 20
  - [[-1, 15, 8], 1, Concat, [1]]  # 21

    # ---------- ODCM -----------
  - [-1, 3, C2f, [512]]            # 22
  - [-1, 1, ODConv, [512]]         # 23 P2
    # ---------------------------

  - [-1, 1, Conv, [512, 3, 2]]     # 24
  - [[-1, 12], 1, Concat, [1]]     # 25

    # ---------- ODCM -----------
  - [-1, 3, C2f, [1024]]           # 26
  - [-1, 1, ODConv, [1024]]        # 27 P3
    # ---------------------------

# Head
  - [[19, 23, 27], 1, Detect, [nc]]  # (P1, P2, P3)
